{
  "embed_model": "BAAI/bge-small-en-v1.5",
  "chunk_size": 900,
  "chunk_overlap": 150,
  "chunks": [
    "JAYA PRAKASH NARAYANA RAAVI \n \n Memphis, TN | +1 (901)-632-2989 | \njpn9121@gmail.com | \nJaya\n \nPrakash\n \n \n| JayaPrakash-Raavi\n \nTECHNICAL SKILLS \nData Engineering : Python, SAS, SQL, R Programing, Kafka, Spark, Snowflake, Databricks, ETL/ELT Data Pipelines. \nDatabases : MySQL, MongoDB, RDS, Big Query. \nBI Tools : Microsoft Excel (Advanced), Power BI, Data Studio, Tableau, Alteryx, Looker, DAX. \nMachine Learning & AI : Pandas, Scikit-Learn, TensorFlow, PyTorch, Deep Learning, CNN \nCloud & Infrastructure : Azure, GitHub, Docker, Kubernetes, Terraform, Jenkins, Linux \nLLM’s &APIs : OpenAI, Data Mining with LLM’s, REST APIs, JSON, XML, Webhooks, Postman \nEXPERIENCE \n Research Specialist at University of Memphis May 2025 – present \n− Built and optimized scalable ETL pipelines to collect, clean, and transform large datasets using Python and SQL. \n− Designed and managed Snowflake data warehous",
    "optimized scalable ETL pipelines to collect, clean, and transform large datasets using Python and SQL. \n− Designed and managed Snowflake data warehouses to support analytics, reporting, and machine learning workflows. \n− Collaborated with cross-functional teams to define data models, validate inputs, and ensure high data integrity. \n− Automated data ingestion and transformation using Airflow and containerized environments for scalability. \n− Implemented data quality checks and monitoring frameworks to maintain reliable, production-ready datasets. \n− Optimized Snowflake queries and warehouse performance, improving processing efficiency and cost control. \nData Analyst at University of Memphis Nov 2023 – Sept 2024 \n− Cleaned and processed over 2M records, improving data accuracy by 95% and reducing errors by 80%. \n− Implemented a dashboard for more than 20 planners that visualized populatio",
    "2M records, improving data accuracy by 95% and reducing errors by 80%. \n− Implemented a dashboard for more than 20 planners that visualized population, household, employment, and land usage data \nacross Tennessee regions using R and several libraries. \n− Analyzed datasets to identify patterns and trends, providing actionable insights that enhanced research project outcomes. \n− Constructed 10+ dashboards and visualizations using Power BI and Tableau, effectively communicating key findings. \n− Python and MATLAB were used to automate 70% of data processing tasks, increasing output and reducing labor hours. \n− Employed VISSIM scripting for traffic data simulation and modeling for 30+ miles, improving accuracy by 25%. \n− Collaborated with research teams to understand data requirements, translating them into insightful analytical reports that \ninformed decision-making. \n Business Intelligence",
    "rch teams to understand data requirements, translating them into insightful analytical reports that \ninformed decision-making. \n Business Intelligence Developer at Innovapath, INC Jul 2021 – Nov 2022 \n− Designed and maintained web-based dashboards using React.js, making sure they are compatible with cross browsers. \n− Built interactive data visualizations using D3.JS and Power BI, making the dashboards easy to understand and use. \n− Developed RESTful APIs using Node.js and Express.js, connecting them to MongoDB for storing and retrieving data. \n− Used Git for version control and participated in Agile processes like sprint planning and daily meetings. \n− Worked closely with developers, data analysts, and designers to add new features and improve existing ones, contributing \nto code reviews and discussions. \nPROJECTS \nDatabase Design for Referral Management Mar 2024 - Jul 2024 \n− Created a",
    "rove existing ones, contributing \nto code reviews and discussions. \nPROJECTS \nDatabase Design for Referral Management Mar 2024 - Jul 2024 \n− Created and constructed a MySQL database to facilitate client follow-ups and referral management. \n− Automated the entire data collection and processing process using Python, reducing manual work. \n− Composed real-time dashboards in Power BI to give team members clear insights into referral trends and follow-up results, \nhelping them make better decisions. Improved the speed of database queries by optimizing how data is retrieved. \n− Worked with the team to ensure data security and meet project needs. \n Tennessee Statewide Land Use Dashboard Feb 2024 - Apr 2024 \n− Designed an interactive R-based dashboard to analyze and visualize Tennessee’s population and land use data. \n− Conducted extensive data wrangling, merging geographic shapefiles with land",
    "ard to analyze and visualize Tennessee’s population and land use data. \n− Conducted extensive data wrangling, merging geographic shapefiles with land -use datasets to ensure consistency. \n− Produced through land, home, employment, and population visualizations for different regions and MPOs, enabling insights \nbased on data. \n− Implemented dynamic filtering on specific regions, categories, demographics, enhancing decision -making capabilities. \nEDUCATION \nMaster of Science, University of Memphis, Tennessee, USA CGPA (3.88 / 4) Jan 2023- Dec 2024\n Master’s in data science with a minor in Bio-statistical learning \nBachelor of Technology, JNTUA college of engineering Pulivendula, INDIA CGPA (3.92 / 4) June 2018- May 2022\n Bachelor’s in electrical and Electronics Engineering with a minor in Computer Science \nCERTIFICATIONS \n− Published a research paper in Transportation Research Board (TRB)",
    "cal and Electronics Engineering with a minor in Computer Science \nCERTIFICATIONS \n− Published a research paper in Transportation Research Board (TRB) Hybrid Optimization of Wiedemann 99 Car-\nFollowing Parameters for Accurate Calibration of Microsimulation Model for Tennessee's Peak-Hour Freeway Traffic. \n− IBM Data Science Basics covers the fundamental aspects of data science, various roles within the field, the data analysis \nprocess, big data, machine learning, deep learning, and artificial intelligence."
  ]
}